# YOLOv5 ? by Ultralytics, GPL-3.0 license

# Parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# 0-P1/2
# 1-P2/4
# 2-P3/8
# 3-P4/16
# 4-P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, efficientvit_b2, [checkpoints/efficientViT/b2-r288.pt]], # 4
   [-1, 1, Conv, [768, 1, 1]],
   [[-1, 2, 1], 1, FCEM, []],
   [-1, 1, SPPF, [1024, 5]],  # 7
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 8
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 9
   [[-1, 3], 1, Concat, [1]],  # cat backbone P4 10
   [-1, 3, C3_CoT, [512, False]],  # 11

   [-1, 1, Conv, [256, 1, 1]], # 12
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 13
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3 14
   [-1, 3, C3_CoT, [256, False]],  # 15 (P3/8-small)

   [[-1, 11, 7], 1, FCEM_down, []],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, 12, 3], 1, Concat, [1]],  # cat head P4 15
   [-1, 3, C3_CoT, [512, False]],  # 16 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]], # 17
   [[-1, 7, 4], 1, Concat, [1]],  # cat head P5 18
   [-1, 3, C3_CoT, [1024, False]],  # 19 (P5/32-large)

   [[16, 19, 22], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
